import React from "react"

import {
  BotIcon,
  CommunityIcon,
  StarIcon,
  HelperIcon,
  ChatIcon,
  ContentIcon,
} from "../Icons"

export interface Advantage {
  name: string
  description: string | null
  icon?: React.ReactNode
}

export const advantages_start: Advantage[] = [
  {
    name: "Календарь актуальных крипто-активностей в одном месте",
    description:
      "Все актуальные раздачи, тестнеты и эирдропы — собраны в одном месте, чтобы ты ничего не упустил.",
  },
  {
    name: "Подробные инструкции для получения наград",
    description:
      "Детальные гайды от экспертов Prime проведут тебя за руку к наградам. Зарабатывай, даже если в крипте вчера начал. С нашими гайдами заработает каждый.",
  },
  {
    name: "Прогрессия: отмечайте выполненные шаги прямо в Календаре",
    description:
      "Ты ничего не пропустишь и точно выполнишь задачи по проекту благодаря удобному чек-листу.",
  },
  {
    name: "Подборки именитых блогеров",
    description:
      "Ты узнаешь какие проекты сейчас отрабатывают блогеры, что актуально у тех, кто давно в крипте.",
  },
  {
    name: "Удобные фильтры и сортировка",
    description:
      "Отсортируй активности по направлениям, сложности или затратам — лови только то, что принесет максимум.",
  },
  {
    name: "Уведомления об изменениях у отслеживаемых проектов",
    description:
      "Не пропусти важное! Уведомления сразу прилетят, если в отслеживаемых проектах что-то поменялось. Будь всегда в курсе всех изменений.",
  },
]

export const advantages_start_compact: Advantage[] = [
  {
    name: "Календарь актуальных крипто-активностей в одном месте",
    description:
      "Все актуальные раздачи, тестнеты и эирдропы — собраны в одном месте, чтобы ты ничего не упустил.",
  },
]

export const advantages_pro: Advantage[] = [
  {
    icon: <StarIcon />,
    name: "Готовые решения для заработка от авторов Prime",
    description:
      "Пошаговые инструкции, аналитика и поддержка по всем направлениям в крипте — всё, чтобы ты начал зарабатывать на крипте с комфортом.",
  },
  {
    icon: <HelperIcon />,
    name: "Поддержка экспертов и личный помощник",
    description:
      "Уперся в сложную задачу? Если уперся в сложную задачу — топовые эксперты Crypton мгновенно подключатся! Они разберут любой твой вопрос, от настройки кошелька до стратегии на миллион — и помогут не упустить прибыль.",
  },
  {
    icon: <ChatIcon />,
    name: "Чаты по направлениям",
    description:
      "Отдельные чаты по ретро, NFT, мемам и другим актуальным направлениям — общайся с опытными криптанами, делись лайфхаками и будь в курсе всего первым.",
  },
  {
    icon: <ContentIcon />,
    name: "Бонусы экосистемы криптон: WL и розыгрыши, Crypton points, эксклюзивные фичи экосистемы",
    description:
      "Возможность участвовать в раздачах, конкурсах и получать эксклюзивные скидки.",
  },
  {
    icon: <CommunityIcon />,
    name: "АМА сессии и совместные отработка (воркшопы)",
    description:
      "Прямые эфиры с интересными гостями, известными блогерами и экспертами в своих нишах. Возможность задать вопрос лично и узнать много нового.",
  },
  {
    icon: <BotIcon />,
    name: "Бот для заработка на мемах",
    description:
      "Runner бот отслеживает и подробно разбирает активы до и после миграции на биржу, отсекая до 90% подозрительных проектов на основе поведенческих факторов и их распределения.",
  },
]
export const advantages_pro_compact: Advantage[] = [
  {
    icon: <StarIcon />,
    name: "Готовые решения для заработка от авторов Prime",
    description:
      "Пошаговые инструкции, аналитика и поддержка по всем направлениям в крипте — всё, чтобы ты начал зарабатывать на крипте с комфортом.",
  },
  {
    icon: <HelperIcon />,
    name: "Поддержка экспертов и личный помощник",
    description:
      "Уперся в сложную задачу? Если уперся в сложную задачу — топовые эксперты Crypton мгновенно подключатся! Они разберут любой твой вопрос, от настройки кошелька до стратегии на миллион — и помогут не упустить прибыль.",
  },
  {
    icon: <ChatIcon />,
    name: "Чаты по направлениям",
    description:
      "Отдельные чаты по ретро, NFT, мемам и другим актуальным направлениям — общайся с опытными криптанами, делись лайфхаками и будь в курсе всего первым.",
  },
]

export const advantages_prime: Advantage[] = [
  {
    name: "Ранний доступ к продуктам Crypton",
    description:
      "Эксклюзивный доступ к новым инструментам и продуктам Crypton раньше всех.",
  },
  {
    name: "Премиум поддержка",
    description:
      "Наши наставники оперативно помогут с решением любых вопросов в мире web3!",
  },
]
