import React, { Fragment } from "react"

import AccordionItem from "./accordionItem"

const Accordion = (props) => {
  const questionsAnswers = [
    {
      question: "Как получить подписку бесплатно?",
      answer: (
        <div className="accordion__title text">
          <p>
          Мы очень ценим активных участников сообщества, поэтому ежемесячно вознаграждаем самых активных бесплатной подпиской.
          </p>
        </div>
      ),
    },
    {
      question: "Можно ли оплатить подписку с банковской карты?",
      answer: (
        <div className="accordion__title text">
          <p>Да, можно! Доступные платежные системы: Mastercard / Visa (только для карт, выпущенных в РФ), Union Pay, MIR. Конвертация в рубли осуществляется по курсу ЦБ РФ.</p>
        </div>
      ),
    },
    {
      question: "Какие гарантии окупаемости подписки?",
      answer: (
        <div className="accordion__title text">
          <p>
            В рамках нашего сообщества вы найдете “гарантированные события”,
            заработок на которых практически обеспечен. Найти их не составит
            труда, поскольку они удобно размещены в отдельном разделе
            веб-календаря.
            <br />
            <br />
            Если ответственно выполнять данные активности, придерживаясь
            ключевых правил и возможностей абуза, то вы окупите подписку. В
            случае, если все гарант. активности были выполнены, но подписку так
            и не удалось окупить по вине нашего сообщества, то обязательно
            напишите{" "}
            <a href="https://t.me/crypton_support" target="_blank">
              Наставнику
            </a>
            , предоставьте все необходимые доказательства участия и мы без
            проблем продлим вам подписку на следующий месяц бесплатно.
            <br />
            <br />
            Обязательно ознакомьтесь с{" "}
            <a
              href="https://telegra.ph/Usloviya-prodleniya-podpiski-po-garantii-06-14"
              target="_blank"
            >
              полными условиями гарантии
            </a>
            . Любые вопросы по гарантии можно задать{" "}
            <a href="https://t.me/crypton_support" target="_blank">
              Наставнику
            </a>
            .
          </p>
        </div>
      ),
    },
    {
      question: "Как сохранить за собой цену подписки?",
      answer: (
        <div className="accordion__title text">
          <p>
            Если вы приобретаете подписку по текущей цене, то фиксируете ее
            стоимость за собой навсегда. Таким образом, даже если цена будет
            повышена до 200 долларов - для вас тариф останется прежним.
            <br />
            <br />
            Единственное условие сохранения цены - это беспрерывное продление
            подписки.
          </p>
        </div>
      ),
    },
    {
      question:
        "Появился вопрос о Prime, ответ к которому не удалось найти. К кому можно обратиться?",
      answer: (
        <div className="accordion__title text">
          <p>
            <a href="https://t.me/crypton_support" target="_blank">
              Наставник Prime
            </a>{" "}
            ответит на все ваши вопросы, связанные с подпиской.
          </p>
        </div>
      ),
    },
    {
      question: "Какой порог входа в сообщество?",
      answer: (
        <div className="accordion__title text">
          <p>
            Рекомендованный банк — от нескольких тысяч долларов. Заработок на
            криптовалюте требует не только время, но и зачастую денежных
            инвестиций, которые в случае получения награды возвращаются с
            лихвой. Гарантия окупа подписки действует с $500, поэтому
            подписываться на сообщество с меньшей суммой — на свой страх и риск!
            <br />
            <br />
            Отметим, заработок возможен только при соответствующих усилиях и
            действиях. Мы предоставляем всю необходимую информацию, что нужно
            делать, и следим за обновлениями, но не отрабатываем события за
            самих пользователей. Поэтому вам остается только действовать — всё
            остальное мы уже сделали за вас.
          </p>
        </div>
      ),
    },
    {
      question: "Почему стоит выбрать Prime? ",
      answer: (
        <div className="accordion__title text">
          <p>
            Prime — это наше детище, которое мы любим и постоянно развиваем.
            Наша главная цель — экономия вашего времени. 24/7 наша команда ищет
            актуальные способы заработка в криптовалюте, собирая всю необходимую
            информацию в одном месте. К каждому событию прилагается пошаговая
            инструкция. Вам же остается принять решение: участвовать в том или
            ином событии или нет.
          </p>
        </div>
      ),
    },
  ]

  function toggle(current) {
    if (current == props.openFaq) {
      props.setOpenFaq(-1)
    } else {
      props.setOpenFaq(current)
    }
  }

  const renderedQuestionsAnswers = questionsAnswers.map((item, i) => {
    const state = i === props.openFaq ? true : false

    return (
      <Fragment key={i}>
        <AccordionItem
          item={item}
          index={i}
          state={state}
          key={i}
          toggle={() => toggle(i)}
          mode={props.mode}
        />
        <div className="accordion__divider"></div>
      </Fragment>
    )
  })

  return (
    <>
      <div className="accordion__divider"></div>
      {renderedQuestionsAnswers}
    </>
  )
}

export default Accordion
