import Avatar from "@/public/images/png/histories/avatar.png"

import History1 from "@/public/images/png/histories/history-1.png"
import History2 from "@/public/images/png/histories/history-2.png"
import History3 from "@/public/images/png/histories/history-3.png"
import History4 from "@/public/images/png/histories/history-4.png"
import History5 from "@/public/images/png/histories/history-5.png"

export const historiesData = [
  {
    avatar: Avatar,
    picture: History1,
    name: "Defigen",
    timeWithPrime: "11 месяцев в Prime",
    description:
      "Зашёл в проект Hashflow на ранних стадиях и с небольшим депозитом получил $1 000 000 в токенах проекта, которые успешно зафиксировал.",
    telegramUsername: "@defigeneration",
    telegramLink: "https://t.me/defigeneration",
    historyTitle: "Как, бросив всё, заработать более полумиллиона рублей 🏆",
    historyDataHTML: `
    <p>Совсем недавно мы провели мини-интервью с одним из участников нашего сообщества, который не так давно присоединился к Prime и уже успел заработать более $8 000.</p>
    <p>Несмотря на хорошую работу и должность технического директора, Иван решил полностью изменить свою жизнь и основательно заняться криптой.</p> 
    <p>О том, что послужило кардинальной сменой деятельности, и как ему помогала беременная жена в начинаниях, Вы сможете прочесть ниже. 💫</p>
    <p>Prime: Как давно ты в Prime, и что сподвигло тебя на это?</p>
    <p>Иван: Работая на заводе, я решил уволиться с должности технического директора в целом с хорошей з/п для нашего региона. После этого я понял, что не хочу работать на кого-то, и основательно занялся криптой. Искал каналы и расширял свои знания. Так и наткнулся на Crypton, где понравилась подача материала. Уже в марте я вступил в Prime.</p>
    <p>Prime: Решительный шаг. Что ты начал отрабатывать?</p>
    <p>Иван: Ещё до вступления я глобально изучил мультиаккинг. Создал 10 аккаунтов в Dolphin со всеми соцсетями и начал отрабатывать активности из видео Crypton (Polyhedra, CC Hackathon и т.д.). После вступления 2-3 дня изучал активности в Prime, так как сразу разбежались глаза.</p> 
    <p>Сначала выполнял Scroll, Linea и другие тестнеты, так как не хотел тратить даже $100 наудачу. Затем стартовала первая неделя в Link3 FunClub, которую я удачно скипнул. Уже на второй неделе я запустил 10 аккаунтов и выбил 70 шардов ($280). Сразу понял, если 10 аккаунтов = $250 чистыми в неделю, то 100 = $2 500. После этого меня понесло.</p>
    <p>Иван: К вопросу аккаунтов я очень педантично подхожу. Для каждого аккаунта своя соцсеть и свой прокси. При помощи Chat GPT пишутся посты согласно продуманной биографии. Забавно, кстати, наблюдать за комментариями и подписчиками, которые не знают, что это AI.</p>
    <p>Prime: Сколько времени у тебя уходило на 100 аккаунтов?</p>
    <p>Иван: На создание такой фермы у нас с женой ушло примерно 3 дня, в течение которых я не спал вообще. При этом жена сидела со мной по 10-12 часов, хотя была на 7 месяце беременности.</p> 
    <p>Когда всё было готово, мы вдвоём отрабатывали Link3 каждый день по 4-5 часов. Вместе с этим я участвовал и в других событиях от Crypton. 2 недели назад я нанял на 8-ми часовой рабочий день человека для отработки Link3, а сам занимался другими делами.</p>
    <p>Prime: Какие у тебя дальнейшие планы? Не рассматриваешь другие направления?</p>
    <p>Иван: Думаю продолжать развиваться в мультиаккинге, да и з/п надо платить человеку, который работает на меня. Точно не брошу в ближайшее время, но начну развиваться в чём-то ещё.</p>
    <p>Напоследок хотел бы сказать всему комьюнити Crypton: спасибо за этот продукт. За 2 месяца бессонных дней и ночей мне удалось заработать чистыми около $8 500, в основном благодаря Link3.</p>
    `,
  },
  {
    avatar: Avatar,
    picture: History2,
    name: "Ioann",
    timeWithPrime: "заглушка",
    description: "Ушел с хорошо оплачиваемой работы, вместе с беременной женой создал 100 аккаунтов для участия в Link3 Funclub, отрабатывал это событие по 4–5 часов в день, благодаря чему выбил NFT на более полумиллиона рублей.",
    telegramUsername: "@uckursor",
    telegramLink: "https://t.me/uckursor",
    historyTitle: "Заглушка",
    historyDataHTML: `Заглушка, жду больше данных 💫</p>`,
  },
  {
    avatar: Avatar,
    picture: History3,
    name: "OculusMan",
    timeWithPrime: "заглушка",
    description: "Пригласил достаточно пользователей по реферальной программе благодаря чатам Prime и своему каналу и получил за это дроп токенов проекта.",
    telegramUsername: "@OculusMan",
    telegramLink: "https://t.me/OculusMan",
    historyTitle: "Заглушка",
    historyDataHTML: `<p>Заглушка, жду больше данных 💫</p>`,
  },
  {
    avatar: Avatar,
    picture: History4,
    name: "YΞRNUR",
    timeWithPrime: "заглушка",
    description: "Следил и участвовал во всех активностях и кампаниях проекта, что в итоге принесло ему востребованные на рынке NFT и приоритетную очередь в токенсейле проекта на Coinlist, которые позволили зафиксировать солидную сумму.",
    telegramUsername: "@ytolep",
    telegramLink: "https://t.me/ytolep",
    historyTitle: "Заглушка",
    historyDataHTML: `<p>Заглушка, жду больше данных 💫</p>`,
  },
  {
    avatar: Avatar,
    picture: History5,
    name: "Junhoh",
    timeWithPrime: "заглушка",
    description: "Накрутил рефералов через сайты для заработка в Интернете и получил ретродроп от проекта.",
    telegramUsername: "@degen_junhoh",
    telegramLink: "https://t.me/degen_junhoh",
    historyTitle: "Заглушка",
    historyDataHTML: `<p>Заглушка, жду больше данных 💫</p>`,
  }
]
