import Avatar from "@/public/images/png/histories/avatar.png"
import Defigen from "@/public/images/png/histories/defigen.png"
import Ioann from "@/public/images/png/histories/ioann.png"
import Oculus from "@/public/images/png/histories/oculus.png"
import Ernur from "@/public/images/png/histories/ernur.png"
import Junhoh from "@/public/images/png/histories/junhoh.png"
import Maxxunit from "@/public/images/png/histories/maxxunit.jpg"
import Hanzohatoru from "@/public/images/png/histories/hanzohatoru.jpg"
import Strayff from "@/public/images/png/histories/strayff.jpg"

import History1 from "@/public/images/png/histories/history-1.png"
import History2 from "@/public/images/png/histories/history-2.png"
import History3 from "@/public/images/png/histories/history-3.png"
import History4 from "@/public/images/png/histories/history-4.png"
import History5 from "@/public/images/png/histories/history-5.png"
import History6 from "@/public/images/png/histories/history-6.png"
import History7 from "@/public/images/png/histories/history-7.png"
import History8 from "@/public/images/png/histories/history-8.png"

export const historiesData = [
  {
    avatar: Strayff,
    picture: History8,
    name: "Strayff",
    timeWithPrime: "В Prime с 2022 года",
    description:
      "Начал путь с CS, ошибался и терпел неудачи, но никогда не сдавался и не переставал верить в себя, благодаря чему и получил свой lifechange на $21 000.",
    telegramUsername: "@strayff",
    telegramLink: "https://t.me/strayff",
    historyTitle: "Шансы все же реальны.",
    historyDataHTML: `<p>Самая крутая фиксация в моей жизни произошла благодаря Паше, и она не материальна.</p>

<p>Начинал я своё знакомство с рубрики "с ключа до пк", но через пару неудач я оставил свои попытки поднять $$$ на маркетах по кс/доте.</p>

<p>Я играл в доту целыми днями и не заметил "призыва" Паши пойти с ним изучать удивительный мир криптовалют... Развивалось всё вокруг, кроме меня.</p>

<p>Спустя приличное количество времени я наткнулся на фиксацию земель Sandbox, где Паша колил их покупку за копейки и со временем они стоили как реальные земельные участки. Тогда то я и купил свою первую подписку на тогда ещё Криптон Академию. В первые же дни я выиграл wl на Spottie, где минт обошёлся мне 30к рублей. Нфт я не продал по неопытности и жажды миллионов, до сих пор валяется на кошельке и не стоит ничего. Это были заёмные деньги и бесценный опыт. Всё это произошло под закат "бычки". Благодаря команде и людям в чате я находил ответы на все свои вопросы, даже не задавая их, тем самым набирался опыта и понимания как всё устроено. Первую среднюю зарплату жителя моего города я заработал с поста Паши про ивент в генопетс, сминтив кристаллы, получив попутно море позитива разгадывая загадки вместе с участниками Криптона. Позже сами Криптон сделал подобный ивент, что принёс ещё больше позитивных эмоций, а следом и новогодние ивенты. Получил случайный дроп от Арбитрума, благодаря Сане из "Криптосхем" играя в игру Beacon. Получал и дроп от sui, starknet, не говоря уже о более мелких темках, на которых я перебивался всю "медвежку". За всё это время я пропустил немало "лайфченджей" из а свой лени, но и приобрёл не мало, начиная от финансовой грамотности, заканчивая написанием ботов для автоматизации активностей. Во все моменты уныния, когда думал пойти работать в "офис", не опускать руки мне помогали посты/кружки от Паш и "Seva торгует", они помогли не только не сдастся, а обрести "новое" для меня мышление и образ жизни. Например, я узнал о методе Вима Хофа, который практикую и чувствую как это работает. Влетал и испытывал себя в челлендже под названием "RD90", но взвалив на себя слишком много задач я сдался буквально на 15й день. Постепенно становилось проще прививать себе правильные привычки, в том числе благодаря участию в челленджах и мотивации от ребят. Без сомнения, эти парни стали для меня настоящим Примером.</p>

<p>Не сдавался и верил.</p>

<p>Я получил свой "лайфчендж" выиграв аллокацию токена GMRX на BB и зафиксировал 21к$, но главная фиксация, это непотерянная вера в себя и крипту.</p>

<p>Многое что можно было ещё написать, но вывод простой, я получил лучшую версию себя, благодаря знакомству с каналом Паши. Безмерно благодарен Паше, Максиму, Команде Криптон и людям, что идут со мной бок о бок в чате! ❤️ Случайный ролик на YT изменил мою жизнь :)</p>`,
  },
  {
    avatar: Hanzohatoru,
    picture: History7,
    name: "Hanzohatoru",
    timeWithPrime: "В Prime с 2021 года",
    description:
      "Пролетел с раффлом и пропустил активность с кодами. Но, вложившись в NFT исключительно для получения дропа, смог заработать $10 000+.",
    telegramUsername: "@hanzohatoru",
    telegramLink: "https://t.me/hanzohatoru",
    historyTitle: "Заработал 10 тысяч на меме",
    historyDataHTML: `<p>На Memeland я обратил внимание в июне, когда начался хайп с кодами. Тогда из-за отсутствия информации и непонятной механики я решил пропустить активность и продолжил увеличивать свою ферму. При этом NFT Potatoz и Captainz я внес в Watchlist и следил за ними.</p>

<p>В начале августа я решил купить по приемлемой для меня цене одну NFT Potatoz за 1.34 $ETH. Тогда в моменте я мог зафиксировать NFT в +1k долларов, однако покупал я именно для дропа. Уже в сентябре решил усредниться и купил вторую NFT Potatoz за 1.04 $ETH.</p>

<p>В октябре, после объявления о завершении истории с кодами, приобрел 5 штук за $150 из-за антифомо.</p>

<p>Затем закинул в Firesale свои NFT и коды на раффл, и благополучно пролетел.</p>

<p>За полчаса до листинга открыли клейм. В первые же минуты забрал дроп и отправил их на Binance. В последствии понял, что это была ошибка и нужно было отправлять на MEXC.</p>

<p>Средняя цена продажи за токен составила $0.025, За счёт чего удалось получить ~$2 500. Плюс ещё 228 тысяч токенов находятся в блокировке.</p>`,
  },
  {
    avatar: Maxxunit,
    picture: History6,
    name: "Maxxunit",
    timeWithPrime: "В Prime с 2022 года",
    description:
      "Поверил в детище тех, кто раздаёт шумные дропы, отработал проект по максимуму и не прогадал. Так и получилось заработать примерно 1 миллион рублей.",
    telegramUsername: "@maxxunit",
    telegramLink: "https://t.me/maxxunit",
    historyTitle: "Мультанул на 100+ аккаунтов.",
    historyDataHTML: `<p><strong>Prime: </strong><em>Почему ты решил делать XAI, что тебя зацепило в проекте?</em></p>
    <p><strong>Maxxunit: </strong>Если без лукавства - потому что лоубанк и хватаюсь за всё подряд, в прямом смысле этого слова ) Проект зацепил связью с Арбитрумом. Детище от тех, кто сыпет такие шумные дропы, пропускать категорически запрещено. Я и не пропустил.</p>

<p><strong>Prime: </strong><em>Часто делаешь активности с нулевыми вложениями?</em></p>
<p><strong>Maxxunit: </strong>Да, на то есть причины. В том числе одна из них - проверка себя на прочность с задачей а возможно ли вообще в крипте "с нуля" достичь хорошего заработка.</p>

<p><strong>Prime: </strong><em>Совпала реальность с твоими ожиданиями от проекта? Доволен ли ты результатом?</em></p>
<p><strong>Maxxunit: </strong>За второй год плотного присутствия в крипте я понял одно - никаких ожиданий, чтобы не давать лишнего повода для разочарований ) Результатом я более чем доволен, потому что это мои первые большие деньги в здесь. И это было сюрпризом.</p>

<p><strong>Prime: </strong><em>Сколько аккаунтов загнал в проект и много ли заняло времени?</em></p>
<p><strong>Maxxunit: </strong>Загонял 59 штук. Из них дроп получили 26 штук (роль "Vanguard" - 1 шт. и "Legendary" - 25 шт). Каждый из 25 акков занимал около 20-30 минут, 80% времени из которых была игрушка. На другие акки выделил около 10 минут.</p>

<p><strong>Prime: </strong><em>Сколько тебе удалось заработать с этого проекта?</em></p>
<p><strong>Maxxunit: </strong>Всего 11627 $XAI (~ 1 миллион рублей). Продал всего 1000 $XAI на текущие расходы, остальное в HODL. Почему? Если не описывать до косточек проект, то причина проста: скорая бычка, халвинг битка и моя вера в памп токена. К тому же текущий тренд показывает, что сливать все токены на листинге, тем более от дочек именитых команд, не лучший вариант. Плюс gamefi сектор также начнёт расти, а $XAI заточен под игры.</p>

<p><strong>Prime: </strong><em>Что посоветуешь новичкам в Prime?</em></p>
<p><strong>Maxxunit: </strong>Дорогие новички, в особенности новички с банком такого уровня, когда оплата подписки и расходников - это боль для тебя. Бывают люди везучие (поднимают тысячи банков с первых месяцев в крипте, в частности в Прайме), а бывают те, которые без труда по жизни фигу с маслом только получают. Я из второй категории. К этому 1 млн.руб. я шёл с конца ноября 22 года, то есть 14 месяцев. Считайте это пессимистичным вариантом и у вас будет всё быстрее при следующих условиях:

<br />- Время. Выделяйте на старте максимум, отбрасывая всё то, что не приносит вам пользу - ютюбчик, сериальчики и всё в этом духе.
<br />- Цель. Нельзя бесцельно и бездумно постоянно что-то тыкать и при этом сохранять бодрость духа ) Возьми листок с бумагой, обозначь конкретные задачи, которые нужно решить и сколько для этого нужно денежных средств, как пример.
<br />- Усердие/дисциплина/упорство - всё, то, благодаря чему ты не будешь знать, что такое выгорание. В тандеме с целью у тебя никогда не возникнет вопросов "и сколько мне этим заниматься?".
<br />- Учиться новому. Постоянно читайте чат, ютюб канал Криптона, общайтесь,задавайте вопросы, практикуйтесь. Делайте ошибки, много ошибок, ибо без них ничему не научитесь, такова природа. Благодаря этому я попадал 7 месяцев подряд в список самых активных участников, что давало на первых порах очень крутой и спасительный для меня бонус - бесплатная подписка (45$/мес).
<br />- Вдохновляйтесь. Примерами ребят из Прайма! Это очень круто меня заряжало и заряжает до сих пор. Ох сколько я насмотрелся этого ) Теперь глядя на мой пример может тоже кто-то также зарядится и начнёт плотно работать. Когда для меня 1000$ было чем-то заоблачным. Сейчас же результаты 23 года начинают себя показывать в текущем 24-м году.</p>

<p>Всех обнял, Родные! С уверенностью говорю, что именно Родные, а не просто криптаны с приватки =)</p>`,
  },
  {
    avatar: Junhoh,
    picture: History5,
    name: "Junhoh",
    timeWithPrime: "В Prime с октября 2022",
    description:
      "Накрутил рефералов по реф. программе Arkham через сайты для заработка в Интернете и получил ретродроп от проекта на $3000.",
    telegramUsername: "@degen_junhoh",
    telegramLink: "https://t.me/degen_junhoh",
    historyTitle: "Как Prime зарабатывал на Arkham 🏆",
    historyDataHTML: `<p>Не так давно Arkham залистился на Binance, и многие пользователи смогли заработать $150 за клик или более $1 500 за простейшую активность.</p>
    <p><strong>Junhoh:</strong> <em>За неделю накрутил рефералов на буксах всего лишь на два аккаунта. После чего забыл про эту активность. Хоть немного и порезали реварды, но удалось заработать чуть больше $3 000.</em></p>`,
  },
  {
    avatar: Ernur,
    picture: History4,
    name: "YΞRNUR",
    timeWithPrime: "В Prime с ноября 2022",
    description:
      "Следил и участвовал во всех активностях и кампаниях Link3 & Cyberconnect, что в итоге принесло ему востребованные на рынке NFT и приоритетную очередь в токенсейле проекта на Coinlist. Благодаря этому удалось заработать $5000.",
    telegramUsername: "@ytolep",
    telegramLink: "https://t.me/ytolep",
    historyTitle: "Заработок на CyberConnect 🏆",
    historyDataHTML: `<p>CyberConnect &mdash; уникальный проект, который провел успешный токенсейл, позволил многим хорошо заработать на минишардах, а также не забыл и о хантерах за ретродропами.</p><p><strong>Y&Xi;RNUR:</strong><em> Изучать дискорд и документацию CyberConnect я начал, когда он только появился на Galxe, где я следил за свежими проектами. Затем возник Link3, где за красивое заполнение профиля раздавали боксы. Взяв инвайт и оформив профиль мне удалось один бокс заполучить. Вместе с этим участвовал в активностях на Link3: Grand NFT, FunClub и т.д. Фармя минишарды получил несколько приоритеток на Coinlist, после чего часть минишардов продал, чтобы Coinlist вышел в 0.</em></p>
    <p><em>Так за лето мне удалось получить три дропа: CyberConnect, Arkham и Maverick, которые принесли мне $5 000, $7 000 и $20 000 соответственно.</em></p>`,
  },
  {
    avatar: Oculus,
    picture: History3,
    name: "OculusMan",
    timeWithPrime: "В Prime с января 2022",
    description:
      "Участвуя в реферальной программе проекта Arkham, пригласил достаточно участников из чатов Prime и подписчиков своего канала для получения дропа на $6500.",
    telegramUsername: "@OculusMan",
    telegramLink: "https://t.me/OculusMan",
    historyTitle: "Как Prime зарабатывал на Arkham 🏆",
    historyDataHTML: `<p>Не так давно Arkham залистился на Binance, и многие пользователи смогли заработать $150 за клик или более $1 500 за простейшую активность.</p>
    <p><strong>OculusMan:</strong> <em>Изначально было 4 аккаунта, на которые понемногу приглашал участников. Так как первое время было ограничение в 10 приглашений, то приходилось выдавать их с других аккаунтов.</em></p>
    <p><em>Мотивировал переходить по реф. ссылке и участвовать в проекте как в сообществе Prime, так и в своём канале. В итоге набралось довольно много рефералов и удалось заработать $6 500.</em></p>`,
  },
  {
    avatar: Ioann,
    picture: History2,
    name: "Ioann",
    timeWithPrime: "В Prime с марта 2023",
    description:
      "Ушел с хорошо оплачиваемой работы, вместе с беременной женой создал 100 аккаунтов для участия в Link3 Funclub, отрабатывал это событие по 4–5 часов в день, благодаря чему выбил NFT на более полумиллиона рублей.",
    telegramUsername: "@iomayb",
    telegramLink: "https://t.me/iomayb",
    historyTitle: "Как, бросив всё, заработать более полумиллиона рублей 🏆",
    historyDataHTML: `<p>Совсем недавно мы провели мини-интервью с одним из участников нашего сообщества, который не так давно присоединился к Prime и уже успел заработать более $8 000.</p>
    <p>Несмотря на хорошую работу и должность технического директора, Иван решил полностью изменить свою жизнь и основательно заняться криптой.</p>
    <p>О том, что послужило кардинальной сменой деятельности, и как ему помогала беременная жена в начинаниях, Вы сможете прочесть ниже. 💫</p>
    <p><strong>Prime:</strong> <em>Как давно ты в Prime, и что сподвигло тебя на это?</em></p>
    <p><strong>Иван:</strong> <em>Работая на заводе, я решил уволиться с должности технического директора в целом с хорошей з/п для нашего региона. После этого я понял, что не хочу работать на кого-то, и основательно занялся криптой. Искал каналы и расширял свои знания. Так и наткнулся на Crypton, где понравилась подача материала. Уже в марте я вступил в Prime.</em></p>
    <p><strong>Prime:</strong> <em>Решительный шаг. Что ты начал отрабатывать?</em></p>
    <p><strong>Иван:</strong> <em>Ещё до вступления я глобально изучил мультиаккинг. Создал 10 аккаунтов в Dolphin со всеми соцсетями и начал отрабатывать активности из видео Crypton (Polyhedra, CC Hackathon и т.д.). После вступления 2-3 дня изучал активности в Prime, так как сразу разбежались глаза.</em></p>
    <p><em>Сначала выполнял Scroll, Linea и другие тестнеты, так как не хотел тратить даже $100 наудачу. Затем стартовала первая неделя в Link3 FunClub, которую я удачно скипнул. Уже на второй неделе я запустил 10 аккаунтов и выбил 70 шардов ($280). Сразу понял, если 10 аккаунтов = $250 чистыми в неделю, то 100 = $2 500. После этого меня понесло.</em></p>
    <p><strong>Иван:</strong> <em>К вопросу аккаунтов я очень педантично подхожу. Для каждого аккаунта своя соцсеть и свой прокси. При помощи Chat GPT пишутся посты согласно продуманной биографии. Забавно, кстати, наблюдать за комментариями и подписчиками, которые не знают, что это AI.</em></p>
    <p><strong>Prime:</strong> <em>Сколько времени у тебя уходило на 100 аккаунтов?</em></p>
    <p><strong>Иван:</strong> <em>На создание такой фермы у нас с женой ушло примерно 3 дня, в течение которых я не спал вообще. При этом жена сидела со мной по 10-12 часов, хотя была на 7 месяце беременности.</em></p>
    <p><em>Когда всё было готово, мы вдвоём отрабатывали Link3 каждый день по 4-5 часов. Вместе с этим я участвовал и в других событиях от Crypton. 2 недели назад я нанял на 8-ми часовой рабочий день человека для отработки Link3, а сам занимался другими делами.</em></p>
    <p><strong>Prime:</strong> <em>Какие у тебя дальнейшие планы? Не рассматриваешь другие направления?</em></p>
    <p><strong>Иван:</strong> <em>Думаю продолжать развиваться в мультиаккинге, да и з/п надо платить человеку, который работает на меня. Точно не брошу в ближайшее время, но начну развиваться в чём-то ещё.</em></p>
    <p><em>Напоследок хотел бы сказать всему комьюнити Crypton: спасибо за этот продукт. За 2 месяца бессонных дней и ночей мне удалось заработать чистыми около $8 500, в основном благодаря Link3</em></p>`,
  },
  {
    avatar: Defigen,
    picture: History1,
    name: "Defigen",
    timeWithPrime: "В Prime с октября 2021",
    description:
      "Зашёл в проект Hashflow на ранних стадиях и с небольшим депозитом получил $1 000 000 в токенах проекта, которые успешно зафиксировал.",
    telegramUsername: "@defigeneration",
    telegramLink: "https://t.me/defigeneration",
    historyTitle: "Как участник Crypton Prime заработал $1 млн 💰",
    historyDataHTML: `
    <p>Мы провели короткое интервью с Defigen — человеком, который смог вынести $1 млн. с Hashflow и является давним участником Crypton Prime.</p>
    <p>Вы узнаете, как Defigen нашёл Hashflow, почему решил отрабатывать именно его, с каким подводными камнями столкнулся и можно ли было вынести Hashflow без большого банка.</p> 
    <p>А уже в четверг здесь, в Crypton Prime, мы проведём AMA-сессию с Defigen, на которой Вы сможете задать ему Ваши вопросы.</p>
    <p>Вводные данные: на Hashflow можно было фармить токен $HFT до его выпуска путём отправки средств в пул.</p>
    <p><b>Crypton Prime</b>: <i>Почему ты решил отрабатывать именно Hashflow? Что стало решающим фактором?</i></p>
    <p><b>Defigen</b>: <i>О нём проскакивала информация в моих полях, но шилла не было жесткого. Я сам пошел ресерчить, посмотрел интерфейс: бомба, минимализм, фонды — норм, классные нфт за активности — еще плюс. Ну, и сами активности. Команда — благословленные кремниевой долиной. Страха вообще не было, т.к. не очередная форк-фармилка. Красивые админы, без прикола.</i></p>
    <p><u>Итого, ключевые факторы</u>: отсутствие сильного шилла проекта (иногда раздают и перешиленные проекты); красивый и удобный интерфейс продукта; топовые фонды, инвестировавшие в проект; проработаны разные аспекты продукта, включая NFT и метавселенную; самобытный и уникальный продукт, не очередной форк Uniswap; красивые админы.</p> 
    <p><b>Crypton Prime</b>: <i>Почему не было принудительного вестинга, как у многих других получателей дропа?</i></p>
    <p><b>Defigen</b>: <i>Я фармил успешно до августа, вестинг начался с середины июля.</i></p>
    <p><u>Вывод</u>: необязательно быть самым первым в проекте, достаточно качественно его отрабатывать.</p>
    <p><b>Crypton Prime</b>: <i>Как ты выводил такое большое количество токенов? Софтом?</i></p> 
    <p><b>Defigen</b>: <i>Да, так как ожидал, что будет наплыв желающих забрать дроп и понести как можно скорее в стакан, что и случилось, собственно. Софт зарешал на самом деле. Писал не сам, у tern'a попросил.</i></p>
    <p><u>Вывод</u>: если у Вас есть возможность каким-то образом автоматизировать действия и получить преимущество перед другими пользователями, делайте это.</p>
    <p>Иван: Думаю продолжать развиваться в мультиаккинге, да и з/п надо платить человеку, который работает на меня. Точно не брошу в ближайшее время, но начну развиваться в чём-то ещё.</p>
    <p><b>Crypton Prime</b>: <i>Можно ли было вынести Hashflow без депозита? Ты, как я знаю, фармил банком на протяжении двух месяцев.</i></p>
    <p><b>Defigen</b>: <i>Для думающих, что «ааа он бабками задавил»: были общедоступные ивенты с низкой конкуренцией на нфт со 60-120к токенов</i></p>
    <p><u>Вывод</u>: для больших профитов необязательно иметь большой банк, в таком случае в проект лучше зайти на более ранней стадии.</p>
    `,
  },
]
