import Avatar from "@/public/images/png/histories/avatar.png"

export const historiesData = [
  {
    avatar: Avatar,
    name: "Иван",
    timeWithPrime: "11 месяцев в Prime",
    description:
      "Иван заработал $8500 на дропах Link3, инструкции к которым освещались в Crypton Prime",
    telegramUsername: "@telegram_ivana",
    telegramLink: "#",
    historyTitle: "Как, бросив всё, заработать более полумиллиона рублей 🏆",
    historyDataHTML: `
    <p>Совсем недавно мы провели мини-интервью с одним из участников нашего сообщества, который не так давно присоединился к Prime и уже успел заработать более $8 000.</p>
    <p>Несмотря на хорошую работу и должность технического директора, Иван решил полностью изменить свою жизнь и основательно заняться криптой.</p> 
    <p>О том, что послужило кардинальной сменой деятельности, и как ему помогала беременная жена в начинаниях, Вы сможете прочесть ниже. 💫</p>
    <p>Prime: Как давно ты в Prime, и что сподвигло тебя на это?</p>
    <p>Иван: Работая на заводе, я решил уволиться с должности технического директора в целом с хорошей з/п для нашего региона. После этого я понял, что не хочу работать на кого-то, и основательно занялся криптой. Искал каналы и расширял свои знания. Так и наткнулся на Crypton, где понравилась подача материала. Уже в марте я вступил в Prime.</p>
    <p>Prime: Решительный шаг. Что ты начал отрабатывать?</p>
    <p>Иван: Ещё до вступления я глобально изучил мультиаккинг. Создал 10 аккаунтов в Dolphin со всеми соцсетями и начал отрабатывать активности из видео Crypton (Polyhedra, CC Hackathon и т.д.). После вступления 2-3 дня изучал активности в Prime, так как сразу разбежались глаза.</p> 
    <p>Сначала выполнял Scroll, Linea и другие тестнеты, так как не хотел тратить даже $100 наудачу. Затем стартовала первая неделя в Link3 FunClub, которую я удачно скипнул. Уже на второй неделе я запустил 10 аккаунтов и выбил 70 шардов ($280). Сразу понял, если 10 аккаунтов = $250 чистыми в неделю, то 100 = $2 500. После этого меня понесло.</p>
    <p>Иван: К вопросу аккаунтов я очень педантично подхожу. Для каждого аккаунта своя соцсеть и свой прокси. При помощи Chat GPT пишутся посты согласно продуманной биографии. Забавно, кстати, наблюдать за комментариями и подписчиками, которые не знают, что это AI.</p>
    <p>Prime: Сколько времени у тебя уходило на 100 аккаунтов?</p>
    <p>Иван: На создание такой фермы у нас с женой ушло примерно 3 дня, в течение которых я не спал вообще. При этом жена сидела со мной по 10-12 часов, хотя была на 7 месяце беременности.</p> 
    <p>Когда всё было готово, мы вдвоём отрабатывали Link3 каждый день по 4-5 часов. Вместе с этим я участвовал и в других событиях от Crypton. 2 недели назад я нанял на 8-ми часовой рабочий день человека для отработки Link3, а сам занимался другими делами.</p>
    <p>Prime: Какие у тебя дальнейшие планы? Не рассматриваешь другие направления?</p>
    <p>Иван: Думаю продолжать развиваться в мультиаккинге, да и з/п надо платить человеку, который работает на меня. Точно не брошу в ближайшее время, но начну развиваться в чём-то ещё.</p>
    <p>Напоследок хотел бы сказать всему комьюнити Crypton: спасибо за этот продукт. За 2 месяца бессонных дней и ночей мне удалось заработать чистыми около $8 500, в основном благодаря Link3.</p>
    `,
  },
  {
    avatar: Avatar,
    name: "Алексей",
    timeWithPrime: "один день в Prime",
    description: "Алексей заработал $1488 на дропах",
    telegramUsername: "@telegram_lehi",
    telegramLink: "#",
    historyTitle: "Как, бросив всё, заработать на крипте🏆",
    historyDataHTML: `
    <p>А вот и наш Лёха, спросим как у него делишки. 💫</p>
    <p>Prime: Как давно ты в Prime, и что сподвигло тебя на это?</p>
    <p>Лёха: Работая на заводе, я решил уволиться с должности технического директора в целом с хорошей з/п для нашего региона. После этого я понял, что не хочу работать на кого-то, и основательно занялся криптой. Искал каналы и расширял свои знания. Так и наткнулся на Crypton, где понравилась подача материала. Уже в марте я вступил в Prime.</p>
    <p>Prime: Решительный шаг. Что ты начал отрабатывать?</p>
    <p>Лёха: Ещё до вступления я глобально изучил мультиаккинг. Создал 10 аккаунтов в Dolphin со всеми соцсетями и начал отрабатывать активности из видео Crypton (Polyhedra, CC Hackathon и т.д.). После вступления 2-3 дня изучал активности в Prime, так как сразу разбежались глаза.</p> 
    <p>Сначала выполнял Scroll, Linea и другие тестнеты, так как не хотел тратить даже $100 наудачу. Затем стартовала первая неделя в Link3 FunClub, которую я удачно скипнул. Уже на второй неделе я запустил 10 аккаунтов и выбил 70 шардов ($280). Сразу понял, если 10 аккаунтов = $250 чистыми в неделю, то 100 = $2 500. После этого меня понесло.</p>
    <p>Лёха: К вопросу аккаунтов я очень педантично подхожу. Для каждого аккаунта своя соцсеть и свой прокси. При помощи Chat GPT пишутся посты согласно продуманной биографии. Забавно, кстати, наблюдать за комментариями и подписчиками, которые не знают, что это AI.</p>
    <p>Prime: Сколько времени у тебя уходило на 100 аккаунтов?</p>
    <p>Лёха: На создание такой фермы у нас с женой ушло примерно 3 дня, в течение которых я не спал вообще. При этом жена сидела со мной по 10-12 часов, хотя была на 7 месяце беременности.</p> 
    <p>Когда всё было готово, мы вдвоём отрабатывали Link3 каждый день по 4-5 часов. Вместе с этим я участвовал и в других событиях от Crypton. 2 недели назад я нанял на 8-ми часовой рабочий день человека для отработки Link3, а сам занимался другими делами.</p>
    <p>Prime: Какие у тебя дальнейшие планы? Не рассматриваешь другие направления?</p>
    <p>Лёха: Думаю продолжать развиваться в мультиаккинге, да и з/п надо платить человеку, который работает на меня. Точно не брошу в ближайшее время, но начну развиваться в чём-то ещё.</p>
    <p>Напоследок хотел бы сказать всему комьюнити Crypton: спасибо за этот продукт. За 2 месяца бессонных дней и ночей мне удалось заработать чистыми около $8 500, в основном благодаря Link3.</p>
    `,
  },
]
