import Avatar from "@/public/images/png/histories/avatar.png"
import Defigen from "@/public/images/png/histories/defigen.png"
import Ioann from "@/public/images/png/histories/ioann.png"
import Oculus from "@/public/images/png/histories/oculus.png"
import Ernur from "@/public/images/png/histories/ernur.png"
import Junhoh from "@/public/images/png/histories/junhoh.png"

import History1 from "@/public/images/png/histories/history-1.png"
import History2 from "@/public/images/png/histories/history-2.png"
import History3 from "@/public/images/png/histories/history-3.png"
import History4 from "@/public/images/png/histories/history-4.png"
import History5 from "@/public/images/png/histories/history-5.png"

export const historiesData = [
  {
    avatar: Defigen,
    picture: History1,
    name: "Defigen",
    timeWithPrime: "В Prime с 1 октября 2021",
    description:
      "Зашёл в проект Hashflow на ранних стадиях и с небольшим депозитом получил $1 000 000 в токенах проекта, которые успешно зафиксировал.",
    telegramUsername: "@defigeneration",
    telegramLink: "https://t.me/defigeneration",
    historyTitle: "Как участник Crypton Prime заработал $1 млн 💰",
    historyDataHTML: `
    <p>Мы провели короткое интервью с Defigen — человеком, который смог вынести $1 млн. с Hashflow и является давним участником Crypton Prime.</p>
    <p>Вы узнаете, как Defigen нашёл Hashflow, почему решил отрабатывать именно его, с каким подводными камнями столкнулся и можно ли было вынести Hashflow без большого банка.</p> 
    <p>А уже в четверг здесь, в Crypton Prime, мы проведём AMA-сессию с Defigen, на которой Вы сможете задать ему Ваши вопросы.</p>
    <p>Вводные данные: на Hashflow можно было фармить токен $HFT до его выпуска путём отправки средств в пул.</p>
    <p><b>Crypton Prime</b>: <i>Почему ты решил отрабатывать именно Hashflow? Что стало решающим фактором?</i></p>
    <p><b>Defigen</b>: <i>О нём проскакивала информация в моих полях, но шилла не было жесткого. Я сам пошел ресерчить, посмотрел интерфейс: бомба, минимализм, фонды — норм, классные нфт за активности — еще плюс. Ну, и сами активности. Команда — благословленные кремниевой долиной. Страха вообще не было, т.к. не очередная форк-фармилка. Красивые админы, без прикола.</i></p>
    <p><u>Итого, ключевые факторы</u>: отсутствие сильного шилла проекта (иногда раздают и перешиленные проекты); красивый и удобный интерфейс продукта; топовые фонды, инвестировавшие в проект; проработаны разные аспекты продукта, включая NFT и метавселенную; самобытный и уникальный продукт, не очередной форк Uniswap; красивые админы.</p> 
    <p><b>Crypton Prime</b>: <i>Почему не было принудительного вестинга, как у многих других получателей дропа?</i></p>
    <p><b>Defigen</b>: <i>Я фармил успешно до августа, вестинг начался с середины июля.</i></p>
    <p><u>Вывод</u>: необязательно быть самым первым в проекте, достаточно качественно его отрабатывать.</p>
    <p><b>Crypton Prime</b>: <i>Как ты выводил такое большое количество токенов? Софтом?</i></p> 
    <p><b>Defigen</b>: <i>Да, так как ожидал, что будет наплыв желающих забрать дроп и понести как можно скорее в стакан, что и случилось, собственно. Софт зарешал на самом деле. Писал не сам, у tern'a попросил.</i></p>
    <p><u>Вывод</u>: если у Вас есть возможность каким-то образом автоматизировать действия и получить преимущество перед другими пользователями, делайте это.</p>
    <p>Иван: Думаю продолжать развиваться в мультиаккинге, да и з/п надо платить человеку, который работает на меня. Точно не брошу в ближайшее время, но начну развиваться в чём-то ещё.</p>
    <p><b>Crypton Prime</b>: <i>Можно ли было вынести Hashflow без депозита? Ты, как я знаю, фармил банком на протяжении двух месяцев.</i></p>
    <p><b>Defigen</b>: <i>Для думающих, что «ааа он бабками задавил»: были общедоступные ивенты с низкой конкуренцией на нфт со 60-120к токенов</i></p>
    <p><u>Вывод</u>: для больших профитов необязательно иметь большой банк, в таком случае в проект лучше зайти на более ранней стадии.</p>
    `,
  },
  {
    avatar: Ioann,
    picture: History2,
    name: "Ioann",
    timeWithPrime: "В Prime с 14 марта 2023",
    description: "Ушел с хорошо оплачиваемой работы, вместе с беременной женой создал 100 аккаунтов для участия в Link3 Funclub, отрабатывал это событие по 4–5 часов в день, благодаря чему выбил NFT на более полумиллиона рублей.",
    telegramUsername: "@iomayb",
    telegramLink: "https://t.me/iomayb",
    historyTitle: "Как, бросив всё, заработать более полумиллиона рублей 🏆",
    historyDataHTML: `<p>Совсем недавно мы провели мини-интервью с одним из участников нашего сообщества, который не так давно присоединился к Prime и уже успел заработать более $8 000.</p>
    <p>Несмотря на хорошую работу и должность технического директора, Иван решил полностью изменить свою жизнь и основательно заняться криптой.</p>
    <p>О том, что послужило кардинальной сменой деятельности, и как ему помогала беременная жена в начинаниях, Вы сможете прочесть ниже. 💫</p>
    <p><strong>Prime:</strong> <em>Как давно ты в Prime, и что сподвигло тебя на это?</em></p>
    <p><strong>Иван:</strong> <em>Работая на заводе, я решил уволиться с должности технического директора в целом с хорошей з/п для нашего региона. После этого я понял, что не хочу работать на кого-то, и основательно занялся криптой. Искал каналы и расширял свои знания. Так и наткнулся на Crypton, где понравилась подача материала. Уже в марте я вступил в Prime.</em></p>
    <p><strong>Prime:</strong> <em>Решительный шаг. Что ты начал отрабатывать?</em></p>
    <p><strong>Иван:</strong> <em>Ещё до вступления я глобально изучил мультиаккинг. Создал 10 аккаунтов в Dolphin со всеми соцсетями и начал отрабатывать активности из видео Crypton (Polyhedra, CC Hackathon и т.д.). После вступления 2-3 дня изучал активности в Prime, так как сразу разбежались глаза.</em></p>
    <p><em>Сначала выполнял Scroll, Linea и другие тестнеты, так как не хотел тратить даже $100 наудачу. Затем стартовала первая неделя в Link3 FunClub, которую я удачно скипнул. Уже на второй неделе я запустил 10 аккаунтов и выбил 70 шардов ($280). Сразу понял, если 10 аккаунтов = $250 чистыми в неделю, то 100 = $2 500. После этого меня понесло.</em></p>
    <p><strong>Иван:</strong> <em>К вопросу аккаунтов я очень педантично подхожу. Для каждого аккаунта своя соцсеть и свой прокси. При помощи Chat GPT пишутся посты согласно продуманной биографии. Забавно, кстати, наблюдать за комментариями и подписчиками, которые не знают, что это AI.</em></p>
    <p><strong>Prime:</strong> <em>Сколько времени у тебя уходило на 100 аккаунтов?</em></p>
    <p><strong>Иван:</strong> <em>На создание такой фермы у нас с женой ушло примерно 3 дня, в течение которых я не спал вообще. При этом жена сидела со мной по 10-12 часов, хотя была на 7 месяце беременности.</em></p>
    <p><em>Когда всё было готово, мы вдвоём отрабатывали Link3 каждый день по 4-5 часов. Вместе с этим я участвовал и в других событиях от Crypton. 2 недели назад я нанял на 8-ми часовой рабочий день человека для отработки Link3, а сам занимался другими делами.</em></p>
    <p><strong>Prime:</strong> <em>Какие у тебя дальнейшие планы? Не рассматриваешь другие направления?</em></p>
    <p><strong>Иван:</strong> <em>Думаю продолжать развиваться в мультиаккинге, да и з/п надо платить человеку, который работает на меня. Точно не брошу в ближайшее время, но начну развиваться в чём-то ещё.</em></p>
    <p><em>Напоследок хотел бы сказать всему комьюнити Crypton: спасибо за этот продукт. За 2 месяца бессонных дней и ночей мне удалось заработать чистыми около $8 500, в основном благодаря Link3</em></p>`,
  },
  {
    avatar: Oculus,
    picture: History3,
    name: "OculusMan",
    timeWithPrime: "В Prime с 28 января 2022",
    description: "Участвуя в реферальной программе проекта Arkham, пригласил достаточно участников из чатов Prime и подписчиков своего канала для получения дропа на $6500.",
    telegramUsername: "@OculusMan",
    telegramLink: "https://t.me/OculusMan",
    historyTitle: "Как Prime зарабатывал на Arkham 🏆",
    historyDataHTML: `<p>Не так давно Arkham залистился на Binance, и многие пользователи смогли заработать $150 за клик или более $1 500 за простейшую активность.</p>
    <p><strong>OculusMan:</strong> <em>Изначально было 4 аккаунта, на которые понемногу приглашал участников. Так как первое время было ограничение в 10 приглашений, то приходилось выдавать их с других аккаунтов.</em></p>
    <p><em>Мотивировал переходить по реф. ссылке и участвовать в проекте как в сообществе Prime, так и в своём канале. В итоге набралось довольно много рефералов и удалось заработать $6 500.</em></p>`,
  },
  {
    avatar: Ernur,
    picture: History4,
    name: "YΞRNUR",
    timeWithPrime: "В Prime с 27 ноября 2022",
    description: "Следил и участвовал во всех активностях и кампаниях Link3 & Cyberconnect, что в итоге принесло ему востребованные на рынке NFT и приоритетную очередь в токенсейле проекта на Coinlist. Благодаря этому удалось заработать $5000.",
    telegramUsername: "@ytolep",
    telegramLink: "https://t.me/ytolep",
    historyTitle: "Заработок на CyberConnect 🏆",
    historyDataHTML: `<p>CyberConnect &mdash; уникальный проект, который провел успешный токенсейл, позволил многим хорошо заработать на минишардах, а также не забыл и о хантерах за ретродропами.</p><p><strong>Y&Xi;RNUR:</strong><em> Изучать дискорд и документацию CyberConnect я начал, когда он только появился на Galxe, где я следил за свежими проектами. Затем возник Link3, где за красивое заполнение профиля раздавали боксы. Взяв инвайт и оформив профиль мне удалось один бокс заполучить. Вместе с этим участвовал в активностях на Link3: Grand NFT, FunClub и т.д. Фармя минишарды получил несколько приоритеток на Coinlist, после чего часть минишардов продал, чтобы Coinlist вышел в 0.</em></p>
    <p><em>Так за лето мне удалось получить три дропа: CyberConnect, Arkham и Maverick, которые принесли мне $5 000, $7 000 и $20 000 соответственно.</em></p>`,
  },
  {
    avatar: Junhoh,
    picture: History5,
    name: "Junhoh",
    timeWithPrime: "В Prime с 20 октября 2022",
    description: "Накрутил рефералов по реф. программе Arkham через сайты для заработка в Интернете и получил ретродроп от проекта на $3000.",
    telegramUsername: "@degen_junhoh",
    telegramLink: "https://t.me/degen_junhoh",
    historyTitle: "Как Prime зарабатывал на Arkham 🏆",
    historyDataHTML: `<p>Не так давно Arkham залистился на Binance, и многие пользователи смогли заработать $150 за клик или более $1 500 за простейшую активность.</p>
    <p><strong>Junhoh:</strong> <em>За неделю накрутил рефералов на буксах всего лишь на два аккаунта. После чего забыл про эту активность. Хоть немного и порезали реварды, но удалось заработать чуть больше $3 000.</em></p>`,
  }
]
