import metamaskSrc from "@/public/images/svg/roadmap/metamask.svg"

// Данные имеют тип вида:
// [
//   {
//     top: { ################################ то, что рендерится сверху
//       imgSrc: metamaskSrc, ################ ссылка на картинку для карточки
//       title: "Ретродроп от Metamask", ##### название карточки
//       isDone: true, ####################### флаг, указывающий выполнена ли активность (фильтрацию не делал, так что желательно при заполнении данных сначала заполнять с флагом `true`, потом уже с `false`)
//       earned: number ###################### кол-во заработанных денег
//       description: string ################# описание проекта (выезжающая панель снизу)
//       isCurrent?: true #################### флаг, указывающий на последнюю выполненную карточку. Рендерит надпись `МЫ ЗДЕСЬ` (это опциональное свойство - ставить только последней карточке с флагом { isDone: `true` })
//     },
//     bottom: { ############################# то, что рендерится снизу
//        аналогично, как для свойства `top`
//     }
//   },
//    .......
// ]

export const data = [
  {
    top: {
      imgSrc: metamaskSrc,
      title: "Ретродроп от Metamask",
      isDone: true,
      earned: 2000,
      description:
        "Проект собрал $900 000 000 инвестиций, не имеет своего токена. Мы ожидаем, что будет бесплатная раздача токенов ранним пользователям.",
    },
    bottom: {
      imgSrc: metamaskSrc,
      title: "Ретродроп от Metamask",
      isDone: true,
      earned: 2000,
      description:
        "Проект собрал $900 000 000 инвестиций, не имеет своего токена. Мы ожидаем, что будет бесплатная раздача токенов ранним пользователям.",
    },
  },
  {
    top: {
      imgSrc: metamaskSrc,
      title: "Ретродроп от Metamask",
      isDone: true,
      earned: 2000,
      description:
        "Проект собрал $900 000 000 инвестиций, не имеет своего токена. Мы ожидаем, что будет бесплатная раздача токенов ранним пользователям.",
    },
    bottom: {
      imgSrc: metamaskSrc,
      title: "Ретродроп от Metamask",
      isDone: true,
      earned: 1000,
      description:
        "Проект собрал $900 000 000 инвестиций, не имеет своего токена. Мы ожидаем, что будет бесплатная раздача токенов ранним пользователям.",
    },
  },
  {
    top: {
      imgSrc: metamaskSrc,
      title: "Ретродроп от Metamask",
      isDone: true,
      earned: 1500,
      description:
        "Проект собрал $900 000 000 инвестиций, не имеет своего токена. Мы ожидаем, что будет бесплатная раздача токенов ранним пользователям.",
    },
    bottom: {
      imgSrc: metamaskSrc,
      title: "Ретродроп от Metamask",
      isDone: true,
      earned: 200,
      description:
        "Проект собрал $900 000 000 инвестиций, не имеет своего токена. Мы ожидаем, что будет бесплатная раздача токенов ранним пользователям.",
    },
  },
  {
    top: {
      imgSrc: metamaskSrc,
      title: "Ретродроп от Metamask",
      isDone: true,
      earned: 478,
      description:
        "Проект собрал $900 000 000 инвестиций, не имеет своего токена. Мы ожидаем, что будет бесплатная раздача токенов ранним пользователям.",
      isCurrent: true,
    },
    bottom: {
      imgSrc: metamaskSrc,
      title: "Ретродроп от Metamask",
      isDone: false,
      description:
        "Проект собрал $900 000 000 инвестиций, не имеет своего токена. Мы ожидаем, что будет бесплатная раздача токенов ранним пользователям.",
    },
  },
  {
    top: {
      imgSrc: metamaskSrc,
      title: "Ретродроп от Metamask",
      isDone: false,
      description:
        "Проект собрал $900 000 000 инвестиций, не имеет своего токена. Мы ожидаем, что будет бесплатная раздача токенов ранним пользователям.",
    },
    bottom: {
      imgSrc: metamaskSrc,
      title: "Ретродроп от Metamask",
      isDone: false,
      description:
        "Проект собрал $900 000 000 инвестиций, не имеет своего токена. Мы ожидаем, что будет бесплатная раздача токенов ранним пользователям.",
    },
  },
]
