import { StaticImageData } from "next/image"

import Jason from "@/public/images/png/testimonials/jason.png"
import Dmitrii from "@/public/images/png/testimonials/dmitrii.png"
import Fiji from "@/public/images/png/testimonials/fiji.png"
import Ivan from "@/public/images/png/testimonials/ivan.png"
import Aleksandr from "@/public/images/png/testimonials/aleksandr.png"
import Lex from "@/public/images/png/testimonials/lex.png"
import Mixail from "@/public/images/png/testimonials/mixail.png"
import Nesterov from "@/public/images/png/testimonials/dmitrii_nesterov.png"
import Markus from "@/public/images/png/testimonials/markus.png"
import Yurii from "@/public/images/png/testimonials/yurii.png"
import Artem from "@/public/images/png/testimonials/artem.png"
import Ujin from "@/public/images/png/testimonials/ujin.jpg"
import FeD9 from "@/public/images/png/testimonials/FeD9.png"
import HappyHolder from "@/public/images/png/testimonials/HappyHolder.png"
import MaxKroz from "@/public/images/png/testimonials/MaxKroz.png"
import Consigliere from "@/public/images/png/testimonials/consigliere.jpg"
import KlemeTin from "@/public/images/png/testimonials/kleme-tin.jpg"
import Gregor from "@/public/images/png/testimonials/Gredor.png"
import Daniel from "@/public/images/png/testimonials/Daniel.jpg"
import Denis_Akimenko from "@/public/images/png/testimonials/Denis_Akimenko.jpg"
import Ring from "@/public/images/png/testimonials/ring.png"
import Pestov300 from "@/public/images/png/testimonials/pestov300.png"
import Yura from "@/public/images/png/testimonials/Yura.jpg"
import Eleven from "@/public/images/png/testimonials/11.png"
import Vitaliy from "@/public/images/png/testimonials/vitaliy.png"
import Abilat from "@/public/images/png/testimonials/abilat.png"

export const testimonialsData: Array<{
  avatar: StaticImageData | string
  name: string
  text: string
  date: string
  link: string
  isNew?: boolean
}> = [
  {
    avatar: Vitaliy,
    name: "Vitaly",
    text: `Я состою в Crypton Prime уже 1.5 года, и за это время успел пройти через многое — и радости больших заработков, и горечь серьезных минусов. Мой путь в крипте начался ещё с TradeParty, где я впервые услышал о Prime, и это стало отправной точкой в мое углубленное путешествие в мир крипты.Благодаря гайдам, доступным в сообществе, я смог освоить огромное количество знаний, которые сегодня помогают мне не только в крипте, но и в работе. Я не скажу, что заработал целое состояние с Prime, но могу уверенно сказать, что большинство техники в моей жизни куплено благодаря деньгам из крипты. Однако самое ценное — это опыт, который я получил. Он уже приносит свои плоды, и я уверен, что впереди — только лучшее.Сообщество за это время тоже сильно изменилось, причем в лучшую сторону.`,
    date: "19.11.24",
    link: "https://t.me/reviews_prime/429",
    isNew: true,
  },
  {
    avatar: Abilat,
    name: "abilat 13",
    text: `Привет! Я в сообществе прайм уже 4 месяца, и на данный момент  это лучшее место для новичков, которое позволяет более мене структурированно изучить все возможности крипторынка. Для меня это хобби, и даже с минимальным стартовым депозитом ($200) удалось заработать на продление подписки, не прилагая сверхусилий. В первую очередь хочется отметить дизайн календаря, как по мне стилистика и фон особенно в темном цвете смотрятся классно. Это реально приятно для восприятия. Количество проектов для отработки впечатляет, если не посвящать этому все время, то приходится парою нагонять упущенное. Однако, есть момент, который хотелось бы улучшить это целостность информации. Сводки за прошедший день в общем чате — отличная идея, но они быстро теряются в потоке. Я пробовал использовать хештеги на основе Movement для упрощения поиска, но эта идея не получила большого отклика.`,
    date: "19.11.24",
    link: "https://t.me/reviews_prime/427",
    isNew: true,
  },
  {
    avatar: Eleven,
    name: "11:11",
    text: `Я пришел в Прайм в начала этого года, в феврале или марте, если мне не изменяет память. На самом деле "ламповости" в последнее время даже добавилось, очень многие пассажиры вышли из прайма и теперь в чате остались только те, чьё мнение и рассуждения приятно послушать. Дискомфорта никакого не чувствуется, всё комьюнити в целом в меру с юморком, новичков никто не буллит, да и сильно токсичных ребят особо не замечал.`,
    date: "03.10.24",
    link: "https://t.me/reviews_prime/413",
    isNew: true,
  },
  {
    avatar: Yura,
    name: "Yura",
    text: `Нахожусь в прайме чуть больше двух недель, из плюсов: 🐳Доступная цена подписки (есть поинты всякие, кешбеки, подарки). Календарь - удобно смотреть активности, есть геймификация. Красивый дизайн всего, приянно выглядит контент, не видел такой заботы об оформлени в других сообществ. Всякие бонусы - баллы, поинты, беспл отс эксроу и тд. Есть нфт, чаты по нодам. Очень много проектов в календаре, скучно не будет, также каждый проект расписан с шагами действий. Есть наставник - можно вопросы задавать. За проектами следят, все обновляется, что удобно, дедлайны тоже обозначают`,
    date: "15.08.24",
    link: "https://t.me/reviews_prime/401",
    isNew: true,
  },
  {
    avatar: Pestov300,
    name: "pestov300",
    text: `Я тут почти год уже, для меня прайм это помощник в мире криптовалюты, поскольку я не занимаюсь этим фулл-тайм, поэтому много времени на ресерч у меня нет, и очень удобно получать повестку о свежих, классных проектах. Из инструментов использую основной, про-чат, аналитику рынка, актуальное, календарь, новости, и также чат щелкунчиков, в основном криптон нравится из-за коммунити, которое готово помочь 24/7`,
    date: "12.07.24",
    link: "https://t.me/reviews_prime/382",
    isNew: true,
  },
  {
    avatar: Ring,
    name: "Ring",
    text: `Приобретал подписку в ноябре прошлого года. Замораживал, т к не было времени отрабатывать активности. В конце июня разморозил. Покупал преимущественно для получения поддержки по установке нод, а так же получения независимого экспертного мнения по различным проектам. Довольно удобно сделан календарь. Так же для тех, у кого нет времени самостоятельно изучать проекты можно получить готовый разбор и оценку приоритетности проекта. Имеются отдельные чаты по нодам, нфт и теханализу, что довольно удобно. Не со всем, что там пишут я согласен, но вцелом информация полезная.`,
    date: "01.07.24",
    link: "https://t.me/reviews_prime/374",
    isNew: true,
  },
  {
    avatar: Denis_Akimenko,
    name: "Denis Akimenko",
    text: `Всем привет! ЗК уже вышел, так что наведу немного суеты) Проходка у меня составила 53/53, в общей сложности получилось 548к ZK или 10,3к ZK в среднем на акк. Так вот хочу сказать спасибо Криптону! Я с вами уже год, вступил весной прошлого года. Знал про дропы, и даже крутил, была небольшая ферма. Но именно Криптон дал мне знания и инструменты, как вести ферму правильно, здесь я узнал все нюансы, про прокси, антидетект браузеры, твиттеры и дискорды, ввод/вывод средств и прочее. И комьюнити! Здесь люди, которые всегда ответят на любые вопросы и помогут. Вы крутые! Спасибо вам!)`,
    date: "18.06.24",
    link: "https://t.me/reviews_prime/367",
    isNew: true,
  },
  {
    avatar: Daniel,
    name: "Даниил",
    text: `Привет. Расскажу про свой опыт пользования crypton prime. Первый раз я вступил сюда в 2022 году, оплатил подписку на месяц и начал отрабатывать популярные на то время идеи (sandbox, genopets, arbitrum и другие). На тот момент я совершил ошибку, подумал, что вступление в прайм = моментальная прибыль. Но это не так, это игра в долгую. Через месяц я не продлил подписку и продолжил отрабатывать лишь sandbox, что в свою очередь давало небольшой профит каждый месяц. В 23 году я неожиданно получил дроп от Arbitrum, который по сути отрабатывал всего пару дней. Я снова зашёл в crypton prime и учёл ошибки прошлого.`,
    date: "08.06.24",
    link: "https://t.me/reviews_prime/360",
    isNew: true,
  },
  {
    avatar: Gregor,
    name: "Gregor",
    text: `Нахожусь в прайме уже год. Начну с плюсов:

- Прайм подойдет как для новичков, так и для опытных криптанов.
- Благодаря активному комьюнити и команде прайма у тебя всегда будет актуальная информация обо всех (не тир100) проектах. Также ребята в чате всегда помогут и ответят на почти любой твой вопрос.
- Прайм один из первых освещает будущие тир1 проекты.
- В прайме курируются все основные направления криптовалют: аирдропы, ретродропы, тестнеты, ноды, НФТ, промоакции.
- Иногда среди участников прайма проводят интерактивы с призами: турниры по покеру/компьютерным играм, квесты-головоломки.
- Часто проводятся АМА-сессии на разные темы.

Конкретные минусы выделить сложно. В плане организации всё практически безупречно (имхо).

Я бы хотел видеть в прайме больше софтов для автоматизации фарма дропов.

Ну и в общем всё. Долго думал, что ещё добавить, но всё, что приходило в голову, уже в разработке/исполнении в прайме.`,
    date: "27.05.24",
    link: "https://t.me/reviews_prime/354",
    isNew: true,
  },
  {
    avatar: KlemeTin,
    name: "KLeme Tin",
    text: `Всем привет, я @Kleme и в прайме уже год.
Пару слов о себе - знаком с криптовалютами не первый день. В 2016-м кэшаутил с Opskins круглую сумму, и выбор пал на крипту. Затем майнинг, параллельно попытки трейдинга. 2021, ботнеты в p2e играх, AW, FW и прочие.

А теперь фидбек по подписке. Я сразу скажу что она у меня не окупается до сих пор. Это результат ряда ошибок. Часть из них были допущены в самом начале, когда не понятно вообще что делать и для чего ты это делаешь.
Другая часть это то как я выбираю проекты. Я привык опираться на крутое техно, но такие проекты не всегда стреляют. Очень часто остаются в тени условных мем токенов и стреляет какая-то унылая фигня.

Прайм - это не кнопка "бабло", это агрегатор информации, без которого тебе придётся потратить в разы больше времени на ресерч. Здесь нет каких-то секретов, инсайдов (привет $points). Здесь всё разложено по полочкам, и если тебе надо, ты достаешь нужный инструмент, не тратя кучу времени. Открываешь книгу и читаешь. Для человека, который занимается еще кучей всего помимо ретро - существенная экономия времени.
Ну и главный козырь подписки, по моему скромному мнению - комьюнити. Максимально юзер френдли. Я не помню чтобы даже на самый тупой вопрос, я не получил ответа.

За год я видел много разных людей, кто приходил на ожиданиях "сейчас вот я купил подписку, и завтра стану миллионером". Но это так не работает. Здесь люди делают деньги, кто сидит и 24/7 тыкает кнопки, автоматизирует, используя инструмент прайма - информацию. Волшебной таблетки не будет, это точно. Так же важно понимать, что помимо платы за подписку, тебе нужны оборотные средства, и чем больше - тем лучше.

Главный вопрос, почему подписка не окупается лично у меня? Да потому что в крипте надо всё-равно помимо усердия еще и немного удачи. Мне немного не везёт (дропы были, но суммы не существенны, по сравнению с затратами).

Всем добра! :)`,
    date: "16.04.24",
    link: "https://t.me/reviews_prime/320",
  },
  {
    avatar: Consigliere,
    name: "Consigliere",
    text: `Вступил в криптон всего месяц назад, за плечами уже имел опыт работы с криптой. Был удивлен организованностью, и ошарашен количеством информации в которую по сей день погружаюсь.
    Ожидал увидеть инфу только по дропам, но тут есть инфа по нфт и нодам. Что тоже для меня оказалось полезным.

    Некоторые гайды показались сложноватыми, но по всем возникающим вопросам, зачастую помогает чат(очень отзывчивое комьюнити). Частно предостерегали меня от необдуманных поступков)

    За месяц принял участие во многих активностях, как с вложениями, так и без них.
    Вложения окупились достаточно быстро, и уже начали приносить прибыль. Считаю это отличным результатом.

    В общем и целом, я всем доволен и буду продлевать подписку ;)`,
    date: "14.04.24",
    link: "https://t.me/reviews_prime/317",
  },
  {
    avatar: MaxKroz,
    name: "Max Kroz",
    text: `В Prime я 9 месяцев - сразу покупал подписку на год. Спустя первый месяц я сразу взял допом подписку ещё на +1 год = 2 года сразу.
    Что мне нравится в Prime:
    1. Всегда в чате помогут и дадут совет;👍
    2. Есть календарь, который всегда стабильно обновляется;
    3. В чат приносят информацию отовсюду + порой проскакивает информация, которой нет ещё нигде, что даёт нам стать возможность ранними пользователями в проектах и купить определённый токен раньше других;👍
    4. Есть чат по нодам. Лайк Богдану - очень активный
    5. Есть чат по NFT;
    6. Стабильная сводка и выжимка основной информации, которая быстро позволяет ориентироваться и сфокусировать время только на основых проектах, который сейчас важны)`,
    date: "11.03.24",
    link: "https://t.me/reviews_prime/278",
  },
  {
    avatar: HappyHolder,
    name: "Happy Holder",
    text: `Прошла всего неделя а я уже создал ферму. И отработал кучу проектов. Жду дропы. Что могу сказать о Crypton Prime. Начну пожалуй с краткого экскурса о себе. Уже более двух лет в крипте. С перерывами. Был большой опыт в разных направлениях. И всегда учился где то новому. За эти годы опробовал разные платные каналы и випки. Так что есть с чем сравнить. Crypton Prime на мой взгляд лучшее из того что я до этого пробовал. Преимущества: Низкий порог входа. Цена за месяц довольно демократичная. За тот сонм информации и возможностей это более чем справедливая цена. В отличии от других подобных сервисов где ценник в разы выше. Плюс важно добавить что команда Crypton дает бесплатное продление подписки в случае если отработка проектов с пометкой «гарант» не дают прибыли, и вы не окупаете стоимость.`,
    date: "21.02.24",
    link: "https://t.me/reviews_prime/263",
  },
  {
    avatar: FeD9,
    name: "FeD9",
    text: `Пишу свой отзыв за 1 год нахождения в приватном сообществе Prime. Без всякой воды буду перечислять плюсы и минусы данного продукта. Конечно мнение будет субъективным. Что я могу выдели из плюсов? Это активное комьюнити. В главном чате по поиску с большой долей вероятности вы сможете найти ответ на ваш вопрос. Можно считать что это некая база данных. Но, если вы не смогли найти ответ, то группа активных участников или амбассадоры смогут вам ответить. Качество постов и инструкция к выполнению активности. Разбор проектов мне очень понравился, вся нужная информация есть, и что самое главное, это не скучно читать. Последовательность действий отработки проекта понятны, как и логика.`,
    date: "14.01.24",
    link: "https://t.me/reviews_prime/232",
  },
  {
    avatar: Ujin,
    name: "Ujin 247",
    text: `В Прайме я с небольшими перерывами с осени 2021 года. В крипте постоянно приходится учится новому и делать то, чего раньше не доводилось. Для меня это всегда связано с сомнениями - правильно ли я делаю, туда ли нажимаю и что вообще происходит. Поэтому, самое ценное для меня в Прайме - сообщество. Тут всегда можно задать вопрос, обсудить решение какой-либо проблемы с опытными коллегами, поделиться своими соображениями и узнать мнение матерых ресерчеров. Есть еще одна неочевидная вещь, которую я стал понимать спустя полтора года. Обзоры проектов и возможности в них нередко выходят тут задолго до их широкого распространения. Много раз в течении этого года когда я пытался понять как я попал в тот или иной дроп в проекте о котором давно забыл, откуда я состою на дискорд серверах райсхайпленных проектов и имею «крутые» роли. И постоянно я прихожу к тому, что более года-полутора назад отработал активность к которой призывал Прайм в зачаточных, но многообещающих проектах в которых ресерчеры разглядели ранний гем. Поэтому новичкам могу посоветовать постоянства и дисциплины - не ливать спуста месяц-другой без золотых гор, а систематически отрабатывать`,
    date: "17.12.23",
    link: "https://t.me/reviews_prime/222",
  },
  {
    avatar: "B",
    name: "Baks",
    text: `Хочу написать свой отзыв о CRYPTON и чуть поделиться своей историей.
    Во первых слежу уже очень давно за их Ютуб каналом и очень нравится подача.
    В сам криптон прайм вступил еще в начале года. Потом пришлось на какое то время заморозить подписку почти на пол года по старой цене. И вообще без проблем вот недавно восстановил подписку по старой цене. Очень благодарен за то что вошли в ситуацию.
    В целом цена/качество, отнишение команды,контент очень нравится.
    Хотел бы еще увидеть аналитику рынка и какие то идеи по альте.
    И не хватает направления по всяким дегенским смарт мани, знаю что это направление очень рисковое и не для всех. Но отслеживая какие то «смарт мани» кошельки можно очень хорошо увеличить депо.
    Также хотелось добавить большой плюс для мене это ОТС. Все подскажут, уберегут от скама и для участников прайма услуги бесплатны!`,
    date: "28.11.23",
    link: "https://t.me/reviews_prime/208",
  },
  {
    avatar: Artem,
    name: "Artem Bahirev",
    text: `Я подписался на crypton в конце апреля (когда были последние дни перед повышением цены на подписку), пришел просто по рекомендации друга (который следит за Пашей с 17 года), в целом не зная особо ничего в теме крипты, ретродропов и остального всего связанного с криптой. Очень хотел изучить и разобраться в этом направлении. И попав в сообщество crypton начал  свой путь. Весьма удачное решение могу сказать, потому что вся информация которая нужна для старта собрана в чатах и сервисах crypton, ребята в чатах всегда подсказывают во всех вопросах, ама сессии с опытными ведущими, подробные разборы проектов, нереально классные сводки по информации каждый день/неделю не дадут упустить важную информацию и помогают быть в курсе всех событий. В целом находиться в "экосистеме Crypton" очень удобно, мне как полному нулю в начале это помогло очень сильно, я не терял много времени на поиск информации, она уже вся собрана, бери и применяй сразу. Сейчас уже более подкованному получается отрабатывать различные проекты намного быстрее и проще (теперь даже учить друга умудряюсь), а с учётом того количества информации, которое нам предоставляет команда crypton и участники сообщества работы тут хватает каждый день.
    Ещё стоит отметить что crypton не стоит на месте и за пол года что я нахожусь в сообществе развивается постоянно, за это отдельный респект👍.
    Ни дня не пожалел за оплаченную подписку, и ещё на год вперёд оплатил (спасибо различным розыгрышам и акциям)❤️`,
    date: "25.11.23",
    link: "https://t.me/reviews_prime/206",
  },
  {
    avatar: Yurii,
    name: "Yurii",
    text: `Начну с того, что Прайм для меня в первую очередь это просто удобный ресурс, в котором собрано все вместе. У меня достаточно много других платформ и источников откуда я получаю информацию, чтобы всегда быть в курсе новых событий или обновления актуальных проектов, но иногда я устаю самостоятельно мониторить сотни источников. Поэтому Прайм – это комфорт.
    Во-вторых, Прайм для меня это общение. В моем инфополе не много, я бы сказал – мало, мест, где можно пообщаться с кем-то о крипте или же просто посидеть в Дискорде. Из моих друзей практически никто не слышал о крипте, а некоторые могли что-то слышать, но им это неинтересно. Поэтому это прекрасное место помогает мне с этой болью.
    В-третьих, это взаимопомощь. Помочь своими знаниями, рассказать подробнее, написать статью или лонгрид, который будет кому-то интересен или же попросить помощи у кого-то из участников, что значительно сэкономит время и участникам в поисках какой-то информации, и мне в отработке какого-то проекта.`,
    date: "24.11.23",
    link: "https://t.me/reviews_prime/203",
  },
  {
    avatar: Markus,
    name: "Markus 💼",
    text: `Всем привет!) Мой отзыв о Prime после 6 месяцев.
    Итак, что такое Prime в моем понимании - это комьюнити из опытных крипто-энтузиастов, которые собрались в одном месте с целью заработать. А когда находишься в среде людей, которые пытаются заработать, то неизбежно и сам начнешь зарабатывать.
    Очень активный живой чат, где ответят на любые вопросы. Но в моем случае, из-за часового пояса, вся деятельность активности проходит вечером, нежели у большинства. Но это не мешает принимать активное участие в жизни сообщества. Более того, участие мотивируется наградами от команды Crypton. За активности дают бесплатные недели/месяцы подписки, периодически проходят доп. ивенты в виде покер турниров и розыгрышей с наградами.`,
    date: "21.11.23",
    link: "https://t.me/reviews_prime/201",
  },
  {
    avatar: Nesterov,
    name: "Дмитрий Нестеров",
    text: `В мир криптовалюты в целом и в Криптон прайм в частности я попал случайно. Раньше когда Паштет снимал видосы про скины кс го, трейдинг и всякие фермы, я с удовольствием смотрел и кое-что повторял. Потом прошло несколько лет, я не следил за ютуб каналом (учился в основном и строил оффлайн карьеру). И тут, случайно, в марте 23 года я наткнулся на видос со знакомым лицом Паштета, где он говорил про какую-то крипту и предлагал прочитать интересную сказку про нее (Crypto Wiki), заодно поучаствовав в розыгрыше на деньги в крипте!
    Я как человек интересующийся и всегда готовый к изучению чего-то нового (особенно технологий) решил последовать его совету, потому что был уверен в этом товарище и на скам нарваться просто не мог. Мне понравился формат знакомства с криптой в виде интерактивной вселенной с приятными бонусами и квестами. В итоге я выиграл 20$ в usdt, холодный аппаратный криптокошелек и узнал что есть технология блокчейна, у которой, на мой взгляд, большое будущее!`,
    date: "19.11.23",
    link: "https://t.me/reviews_prime/195",
  },
  {
    avatar: Mixail,
    name: "Михаил",
    text: `Пришел в прайм 22 марта, через пару дней смотрел как сопраймовцы клеймят арб, облизывался.
    Дернуло зайти в дискорд, начал общаться с ребятами. Оказалось тут собрана вся информация по проектам + аналитика от людей, которые в этой сфере уже долгое время. Получил очень много полезных знаний. Помогли не наступить на те грабли, на которые я бы скорее всего наступил. После втянулся и продолжил работать. Сейчас постоянный посетитель дискорда. Идеальное место, крутим активности, обсуждаем проекты, помогаем друг другу, рофлим друг над другом. Чисто из-за ребят в дс продолжаю продлевать подписку, т.к. после полугода пришло понимание, что все есть в открытом доступе.`,
    date: "05.11.23",
    link: "https://t.me/reviews_prime/185",
  },
  {
    avatar: Aleksandr,
    name: "Александр",
    text: `Всем, привет! Я хотел бы поделиться своим отзывом о сервисе PRIME. С самого начала, было ясно, что главная цель (для меня) в использовании этого сервиса - набраться опыта, а не просто найти кнопку "Бабло". Я бы хотел отметить, что такой подход очень разгружает голову и не позволяет испытывать постоянное FOMO и вообще стрессовать по любому поводу и без.`,
    date: "10.06.23",
    link: "https://t.me/reviews_prime/163",
  },
  {
    avatar: Ivan,
    name: "Іван Пришляк",
    text: `Первый месяц я вместе с криптоном и очень рад быть её частью , до этого много искал к кому присоединиться чтобы дальше двигаться в крипте, потому что самому тяжело успеть уловить все. Тут мне капец как помог веб календарь где просто выделил по категориям и делаешь топ активности подходящие тебе . Также очень рад что всегда готовы помочь другие участники комюнити в чате и я в том же числе. Есть много обучающего видео контента. Я для себя лично открыл что такое хеджирование и теперь с минимальными потерями могу принимать участие в токен сейлах и хеджировать свой риск. Как по мне каждый может найти себе тут друзей с общими интересами . И спасибо ещё раз всем и каждому криптану в криптоне:) `,
    date: "04.06.23",
    link: "https://t.me/reviews_prime/161",
  },
  {
    avatar: Fiji,
    name: "FijiMLK",
    text: `Приветствую тех кто думает о подписке на прайм. Я в окружении этих ребят уже 4ый месяц. Это интересное сообщество, я состою в нескольких приватках, и говорят все познаётся в сравнении. В криптоне тепло, продлевая очередной месяц подписки я задумался за что я плачу, и перед глазами флешбеки и вырезки с чата, как кто-то мне помог, как кто-то задавал глупенькие вопросы по поводу крипты (очевидные вещи) и весь чат срывался отвечать. Хотя казалось бы, гугл ит бро) в первую неделю я окупил годовую подписку (мой внутренний еврей не дал мне оплатить её на год) но я сразу подсчитал что я тут останусь на долго, хоть остальные месяца не были для меня(именно для меня) такими профитными, я платил очередной раз, и не жалел об этом. Потому что ну эти ребята уже все, уже родные, постояльцы чата уже не просто никнеймы, а друзья. Каждый из них, хоть никого в глаза не видел, ассоциируется с каким то образом, все они бомбовые. Вообще меня удивила эта атмосфера адекватного сообщества + обитатели разного поля депозита, кто-то лоу банкич, кто-то хай банкич, а разговаривают все об одном и том же)`,
    date: "17.05.23",
    link: "https://t.me/reviews_prime/157",
  },
  {
    avatar: null,
    name: "Денис",
    text: `Всем здравствуйте! Очень счастлив и рад, что узнал о Прайме! Раньше я участвовал в разных чатах с подписками и прочим, но везде было всего лишь один-два чата, где люди общались. Там были какие-то обсуждения о трейдинге, тестнетах и прочем, но не было продуктов. Для меня самое ценное в Прайме - это именно экосистема. Здесь есть веб- и Telegram-календарь (я им пользуюсь), Ресёрч бот, контент и многое другое. Слушал планы на будущее - понравились тоже. Сообщество тоже отличное, а профессиональные ответы наставника - вообще уникальная вещь, которой нигде нет больше.`,
    date: "23.04.23",
    link: "https://t.me/reviews_prime/154",
  },
  {
    avatar: Lex,
    name: "Lex",
    text: `Всем привет, предыдущий отзыв нашел отклик в моей голове так как много тезисов я прокручивал уже в своих мыслях и они совпали с предыдщим комментатором, поэтому и решил написать пару слов тут. В прайме я с 1 апреля как только во все рупоры начали кричать о повышении цены, не устоял перед столь агрессивным маркетингом и перевел 45 вечнозеленых. Первое, что я встретил это кучу ссылок на чаты, календари, какие-то SHARES, наставники и так далее (сейчас я уже понимаю что к чему, но тогда это было жесть по количеству новых умных слов) + маркетингу криптона поддался не только я, но и еще с тысячу людей, поэтому первое время в чатах был треш с вопросами по типу "а как добавить сеть гоерли в метамаск?" (но был и полезный контент, не буду кривить душой).`,
    date: "20.04.23",
    link: "https://t.me/reviews_prime/168",
  },
  {
    avatar: null,
    name: "Александр",
    text: `Скажу сразу, что я тут чуть меньше месяца, моя подписка на данный момент окупилась на 80% и у меня еще больше 10 дней до конца месяца, поэтому с уверенностью скажу — выполняйте активности #гарант и подписка окупится. Немного предисловия. Не могу сказать, что я пришел совсем без опыта. С 2017 года я интересуюсь рынком криптовалют. Первые пару лет просто следил, потом стал активнее изучать, после начал торговать. И вот однажды я случайно попал на канал криптона и понеслось. В процессе изучения канала я был приятно удивлён, когда вспомнил Павла. Несколько лет назад он делал какой-то проект про криптовалюту. Я слабо помню о чем он был, но отчетливо помню его стрим, где он в прямом эфире трейдил BNB, который на тот момент торговался на отметке ~25$. О самой подписке. Как тут ранее писали, человеку с нулевыми знаниями тут будет очень тяжело, приобретая подписку необходимо иметь хотя бы базовые знания о криптосфере.`,
    date: "05.04.23",
    link: "https://t.me/reviews_prime/144",
  },
  {
    avatar: Dmitrii,
    name: "Дмитрий",
    text: `При первых соприкосновениях с экосистемой Crypton (опускаю сейчас стадии отторжения, торга и т.д. остановившись на принятии) я ощутил то же самое. И чем ближе знакомился (а вступление в Prime очень сближает), тем больше утверждался в мысли что эти ребята делают свои многочисленные продукты в кайф себе, в первую очередь. А как я был удовлетворен (люблю точность) когда посмотрев на тексты что подписаны 2140 увидел почти половину синего текста (ссылок, за каждой из которых стоит первоисточник) сложно передать словами. Есть ли в Crypton и особенно Prime минусы? Естественно, ведь существование идеала противоречило бы земной природе. Да, сейчас большой приток новичков и общий чат растет как на дрожжах, да, поток событий иногда бывает рассчитан на 50 часовой астрономический день и приходится что-то выбирать или, например, некоторые события так и не приносят прибыль (собственный DYOR никто не отменял). Но я вижу как над всем этим команда работает прямо сейчас, и с учётом их заряженности, думаю, все это будет так или иначе решено.`,
    date: "03.04.23",
    link: "https://t.me/reviews_prime/137",
  },
  {
    avatar: Jason,
    name: "Jason J",
    text: `Скажу по себе. В Prime (А тогда это еще была Crypton Academy) я с самого первого дня. Пришел вообще без какого либо понимания, что такое крипта. Я искренне благодарен комьюнити и тем, кто был в команде на тот момент. Не было ни единого вопроса в стиле «Ты дурак что-ли? Не знаешь, как простейшие вещи работают». Мне всегда помогали. Обучали, рассказали как и что работают. Со временем я сам стал членом команды. Работаю в Crypton. Искренне благодарен Паше (создателю экосистемы) за то, какую крутую штуку он создал. Он реально изменил мою жизнь. Подписку окупил на всю жизнь вперед, наверное. Не знаю, как жить теперь без нашего комьюнити и инфы оттуда. Я реально всем советую залететь к нам. Помогут, расскажут и обучат. Большое спасибо, Crypton. Без вас было бы очень тяжело. Рад теперь и самому быть членом команды. Дальше - больше. Подписка окупается ❤️`,
    date: "26.03.23",
    link: "https://t.me/reviews_prime/103",
  },
]
