import Avatar from "@/public/images/svg/testimonials/avatar.svg"

export const testimonialsData = [
  {
    avatar: Avatar,
    name: "Lex",
    text: "Всем привет, предыдущий отзыв нашел отклик в моей голове так как много тезисов я прокручивал уже в своих мыслях и они совпали с предыдщим комментатором, поэтому и решил написать пару слов тут. В прайме я с 1 апреля как только В прайме я с 1 апреля как только В прайме я с 1 апреля как только В прайме я с 1 апреля как только",
    date: "21.06.23",
    link: "#",
  },
  {
    avatar: Avatar,
    name: "Artyom",
    text: "Жили были - не тужили, Prime - чотко. Без Prime - больно",
    date: "24.09.23",
    link: "#",
  },
  {
    avatar: Avatar,
    name: "Лёха",
    text: "Всем привет я Лёха, я из прошлого. Сегодня конец света. Ничего против не имею. Это просто текст ради текста, чтобы вёрстку проверить. Я ни к чему тут не причастен. Вот тут ещё чего-нибудь напишу, чтобы длину текста проверить. Должно работать всё круто! Кстати, как вам погода нынче?",
    date: "21.12.12",
    link: "#",
  },
  {
    avatar: Avatar,
    name: "Алексей",
    text: "Всем привет я Алексей, я из будущего, ничего против не имею. Это просто текст ради текста, чтобы вёрстку проверить. Я ни к чему тут не причастен. Чего-то мне хочется сладенько. Никак понять не могу. Сахару в чай добавить что ли? Пойду-ка почту проверю, может написал кто",
    date: "12.12.24",
    link: "#",
  },
]
