import Avatar from "@/public/images/svg/testimonials/avatar.svg"
import Jason from "@/public/images/png/testimonials/jason.png"
import Dmitrii from "@/public/images/png/testimonials/dmitrii.png"
import Fiji from "@/public/images/png/testimonials/fiji.png"
import Ivan from "@/public/images/png/testimonials/ivan.png"
import Aleksandr from "@/public/images/png/testimonials/aleksandr.png"
import Lex from "@/public/images/png/testimonials/lex.png"

export const testimonialsData = [
  {
    avatar: Jason,
    name: "Jason J",
    text: `Скажу по себе. В Prime (А тогда это еще была Crypton Academy) я с самого первого дня. Пришел вообще без какого либо понимания, что такое крипта. Я искренне благодарен комьюнити и тем, кто был в команде на тот момент. Не было ни единого вопроса в стиле «Ты дурак что-ли? Не знаешь, как простейшие вещи работают». Мне всегда помогали. Обучали, рассказали как и что работают. Со временем я сам стал членом команды. Работаю в Crypton. Искренне благодарен Паше (создателю экосистемы) за то, какую крутую штуку он создал. Он реально изменил мою жизнь. Подписку окупил на всю жизнь вперед, наверное. Не знаю, как жить теперь без нашего комьюнити и инфы оттуда. Я реально всем советую залететь к нам. Помогут, расскажут и обучат. Большое спасибо, Crypton. Без вас было бы очень тяжело. Рад теперь и самому быть членом команды. Дальше - больше. Подписка окупается ❤️`,
    date: "26.03.23",
    link: "https://t.me/reviews_prime/103",
  },
  {
    avatar: Dmitrii,
    name: "Дмитрий",
    text: `При первых соприкосновениях с экосистемой Crypton (опускаю сейчас стадии отторжения, торга и т.д. остановившись на принятии) я ощутил то же самое. И чем ближе знакомился (а вступление в Prime очень сближает), тем больше утверждался в мысли что эти ребята делают свои многочисленные продукты в кайф себе, в первую очередь. А как я был удовлетворен (люблю точность) когда посмотрев на тексты что подписаны 2140 увидел почти половину синего текста (ссылок, за каждой из которых стоит первоисточник) сложно передать словами. Есть ли в Crypton и особенно Prime минусы? Естественно, ведь существование идеала противоречило бы земной природе. Да, сейчас большой приток новичков и общий чат растет как на дрожжах, да, поток событий иногда бывает рассчитан на 50 часовой астрономический день и приходится что-то выбирать или, например, некоторые события так и не приносят прибыль (собственный DYOR никто не отменял). Но я вижу как над всем этим команда работает прямо сейчас, и с учётом их заряженности, думаю, все это будет так или иначе решено.`,
    date: "03.04.23",
    link: "https://t.me/reviews_prime/137",
  },
  {
    avatar: Avatar,
    name: "Александр",
    text: `Скажу сразу, что я тут чуть меньше месяца, моя подписка на данный момент окупилась на 80% и у меня еще больше 10 дней до конца месяца, поэтому с уверенностью скажу — выполняйте активности #гарант и подписка окупится. Немного предисловия. Не могу сказать, что я пришел совсем без опыта. С 2017 года я интересуюсь рынком криптовалют. Первые пару лет просто следил, потом стал активнее изучать, после начал торговать. И вот однажды я случайно попал на канал криптона и понеслось. В процессе изучения канала я был приятно удивлён, когда вспомнил Павла. Несколько лет назад он делал какой-то проект про криптовалюту. Я слабо помню о чем он был, но отчетливо помню его стрим, где он в прямом эфире трейдил BNB, который на тот момент торговался на отметке ~25$. О самой подписке. Как тут ранее писали, человеку с нулевыми знаниями тут будет очень тяжело, приобретая подписку необходимо иметь хотя бы базовые знания о криптосфере.`,
    date: "05.04.23",
    link: "https://t.me/reviews_prime/144",
  },
  {
    avatar: Avatar,
    name: "Денис Скрипник",
    text: `Всем здравствуйте! Очень счастлив и рад, что узнал о Прайме! Раньше я участвовал в разных чатах с подписками и прочим, но везде было всего лишь один-два чата, где люди общались. Там были какие-то обсуждения о трейдинге, тестнетах и прочем, но не было продуктов. Для меня самое ценное в Прайме - это именно экосистема. Здесь есть веб- и Telegram-календарь (я им пользуюсь), Ресёрч бот, контент и многое другое. Слушал планы на будущее - понравились тоже. Сообщество тоже отличное, а профессиональные ответы наставника - вообще уникальная вещь, которой нигде нет больше.`,
    date: "23.04.23",
    link: "https://t.me/reviews_prime/154",
  },
  {
    avatar: Fiji,
    name: "FijiMLK",
    text: `Приветствую тех кто думает о подписке на прайм. Я в окружении этих ребят уже 4ый месяц. Это интересное сообщество, я состою в нескольких приватках, и говорят все познаётся в сравнении. В криптоне тепло, продлевая очередной месяц подписки я задумался за что я плачу, и перед глазами флешбеки и вырезки с чата, как кто-то мне помог, как кто-то задавал глупенькие вопросы по поводу крипты (очевидные вещи) и весь чат срывался отвечать. Хотя казалось бы, гугл ит бро) в первую неделю я окупил годовую подписку (мой внутренний еврей не дал мне оплатить её на год) но я сразу подсчитал что я тут останусь на долго, хоть остальные месяца не были для меня(именно для меня) такими профитными, я платил очередной раз, и не жалел об этом. Потому что ну эти ребята уже все, уже родные, постояльцы чата уже не просто никнеймы, а друзья. Каждый из них, хоть никого в глаза не видел, ассоциируется с каким то образом, все они бомбовые. Вообще меня удивила эта атмосфера адекватного сообщества + обитатели разного поля депозита, кто-то лоу банкич, кто-то хай банкич, а разговаривают все об одном и том же)`,
    date: "17.05.23",
    link: "https://t.me/reviews_prime/157",
  },
  {
    avatar: Ivan,
    name: "Іван Пришляк",
    text: `Первый месяц я вместе с криптоном и очень рад быть её частью , до этого много искал к кому присоединиться чтобы дальше двигаться в крипте, потому что самому тяжело успеть уловить все. Тут мне капец как помог веб календарь где просто выделил по категориям и делаешь топ активности подходящие тебе . Также очень рад что всегда готовы помочь другие участники комюнити в чате и я в том же числе. Есть много обучающего видео контента. Я для себя лично открыл что такое хеджирование и теперь с минимальными потерями могу принимать участие в токен сейлах и хеджировать свой риск. Как по мне каждый может найти себе тут друзей с общими интересами . И спасибо ещё раз всем и каждому криптану в криптоне:) `,
    date: "04.06.23",
    link: "https://t.me/reviews_prime/161",
  },
  {
    avatar: Aleksandr,
    name: "Александр",
    text: `Всем, привет! Я хотел бы поделиться своим отзывом о сервисе PRIME. С самого начала, было ясно, что главная цель (для меня) в использовании этого сервиса - набраться опыта, а не просто найти кнопку "Бабло". Я бы хотел отметить, что такой подход очень разгружает голову и не позволяет испытывать постоянное FOMO и вообще стрессовать по любому поводу и без.`,
    date: "10.06.23",
    link: "https://t.me/reviews_prime/163",
  },
  {
    avatar: Lex,
    name: "Lex",
    text: `Всем привет, предыдущий отзыв нашел отклик в моей голове так как много тезисов я прокручивал уже в своих мыслях и они совпали с предыдщим комментатором, поэтому и решил написать пару слов тут. В прайме я с 1 апреля как только во все рупоры начали кричать о повышении цены, не устоял перед столь агрессивным маркетингом и перевел 45 вечнозеленых. Первое, что я встретил это кучу ссылок на чаты, календари, какие-то SHARES, наставники и так далее (сейчас я уже понимаю что к чему, но тогда это было жесть по количеству новых умных слов) + маркетингу криптона поддался не только я, но и еще с тысячу людей, поэтому первое время в чатах был треш с вопросами по типу "а как добавить сеть гоерли в метамаск?" (но был и полезный контент, не буду кривить душой).`,
    date: "20.04.23",
    link: "https://t.me/reviews_prime/168",
  },
]
