import Avatar from "@/public/images/svg/testimonials/avatar.svg"
import Jason from "@/public/images/png/testimonials/jason.png"

export const testimonialsData = [
  {
    avatar: Jason,
    name: "Jason J",
    text: `Скажу по себе. В Prime (А тогда это еще была Crypton Academy) я с самого первого дня.
Пришел вообще без какого либо понимания, что такое крипта. Я искренне благодарен комьюнити и тем, кто был в команде на тот момент. Не было ни единого вопроса в стиле «Ты дурак что-ли? Не знаешь, как простейшие вещи работают». Мне всегда помогали. Обучали, рассказали как и что работают. Со временем я сам стал членом команды. Работаю в Crypton. Искренне благодарен Паше (создателю экосистемы) за то, какую крутую штуку он создал. Он реально изменил мою жизнь. Подписку окупил на всю жизнь вперед, наверное. Не знаю, как жить теперь без нашего комьюнити и инфы оттуда. Я реально всем советую залететь к нам. Помогут, расскажут и обучат. Большое спасибо, Crypton. Без вас было бы очень тяжело. Рад теперь и самому быть членом команды. Дальше - больше. Подписка окупается ❤️`,
    date: "26.03.23",
    link: "https://t.me/reviews_prime/103",
  },
  {
    avatar: Avatar,
    name: "Artyom",
    text: "Жили были - не тужили, Prime - чотко. Без Prime - больно",
    date: "24.09.23",
    link: "#",
  },
  {
    avatar: Avatar,
    name: "Лёха",
    text: "Всем привет я Лёха, я из прошлого. Сегодня конец света. Ничего против не имею. Это просто текст ради текста, чтобы вёрстку проверить. Я ни к чему тут не причастен. Вот тут ещё чего-нибудь напишу, чтобы длину текста проверить. Должно работать всё круто! Кстати, как вам погода нынче?",
    date: "21.12.12",
    link: "#",
  },
  {
    avatar: Avatar,
    name: "Алексей",
    text: "Всем привет я Алексей, я из будущего, ничего против не имею. Это просто текст ради текста, чтобы вёрстку проверить. Я ни к чему тут не причастен. Чего-то мне хочется сладенько. Никак понять не могу. Сахару в чай добавить что ли? Пойду-ка почту проверю, может написал кто",
    date: "12.12.24",
    link: "#",
  },
]
